---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..SpanDirectionSymbolFailures Properties
BuiltInFailures..::..SpanDirectionSymbolFailures Class See Also Send Feedback
---

The BuiltInFailures..::..SpanDirectionSymbolFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | NonPlanView | Span Direction Symbol can only be placed in a Floor Plan View. |

# See Also

BuiltInFailures..::..SpanDirectionSymbolFailures Class

Autodesk.Revit.DB Namespace